---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarArrayTooShort
source: html/5fc8a4cf-0a4b-2556-dcf5-beb5c560fc29.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarArrayTooShort Property

Rebar Set can't have coincident Bars.

## Syntax (C#)
```csharp
public static FailureDefinitionId RebarArrayTooShort { get; }
```